# Criando os nomes

In [5]:
import pandas as pd

In [6]:
nomes_f = pd.read_json('https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=f')
nomes_m = pd.read_json('https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=m')

In [8]:
print('Quantidade de nomes: ' + str(len(nomes_m) + len(nomes_f)))

Quantidade de nomes: 400

In [9]:
frames = [nomes_f, nomes_m]

In [11]:
nomes = pd.concat(frames)['nome'].to_frame()

In [17]:
nomes.sample(3)

          nome
34   SEBASTIAO
42     MARLENE
103     MAICON

# Incluindo ID dos alunos

In [15]:
import numpy as np
np.random.seed(123)

In [16]:
total_alunos = len(nomes)
total_alunos

400

In [18]:
nomes['id aluno'] = np.random.permutation(total_alunos) + 1

In [21]:
nomes.sample(5)

        nome  id aluno
92     DIOGO       345
166    KELLY        45
98     THAIS        12
142     HUGO        19
184  MARILIA       252

In [23]:
dominios = ['@dominioemail.com.br', '@servicoemail.com']
nomes['dominio'] = np.random.choice(dominios, total_alunos)
nomes.sample(5)

        nome  id aluno               dominio
73     MARCO       137     @servicoemail.com
18  RAIMUNDO       267  @dominioemail.com.br
42   MARLENE       228  @dominioemail.com.br
66  PRISCILA         6  @dominioemail.com.br
28   LEANDRO       336     @servicoemail.com

In [24]:
nomes['email'] = nomes.nome.str.cat(nomes.dominio).str.lower()

In [25]:
nomes.sample(5)

          nome  id aluno               dominio                          email
36      DEBORA        53     @servicoemail.com        debora@servicoemail.com
117     PAMELA       329     @servicoemail.com        pamela@servicoemail.com
22       ANDRE       364  @dominioemail.com.br      andre@dominioemail.com.br
135     RUBENS       376     @servicoemail.com        rubens@servicoemail.com
145  FRANCIELE        40  @dominioemail.com.br  franciele@dominioemail.com.br